app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."recommended" = $1 LIMIT $2  [["recommended", true], ["LIMIT", 1]]
---
  def recommended
    @items = Item.where(recommended: true)