app/controllers/portal_controller.rb

  def show
    @categories = Category.all
---
SELECT "categories".* FROM "categories"